In [2]:
import pandas as pd
df = pd.read_csv('customer.csv')
df.sample(5)

    age  gender   review education experience_level     city purchased
98   22    Male     Good        UG           Expert    Delhi       Yes
47   52  Female     Poor        UG           Expert  Chennai        No
23   52  Female  Average        PG     Intermediate   Mumbai       Yes
28   35    Male     Poor        PG     Intermediate    Delhi        No
62   36    Male     Poor        PG     Intermediate  Chennai        No

In [3]:
df['review'].unique()

array(['Good', 'Average', 'Poor'], dtype=object)

In [4]:
df['education'].unique()

array(['PG', 'UG'], dtype=object)

In [6]:
from sklearn.preprocessing import OrdinalEncoder

oe = OrdinalEncoder()

df['review'] = oe.fit_transform(df[['review']])

df['review'].head()

0    1.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: review, dtype: float64

In [7]:
df['review'].unique()

array([1., 0., 2.])

In [ ]:
mapping = dict(zip(oe.categories_[0], range(len(oe.categories_[0]))))

# oe.categories_[0] → gives category names
# Example: ['average', 'bad', 'good']

# range(len(...)) → creates numbers
# Example: [0, 1, 2]

# zip() → joins them pair-by-pair

# ('average', 0)
# ('bad', 1)
# ('good', 2)

# dict() → converts pairs into dictionary

# {'average': 0, 'bad': 1, 'good': 2}

In [9]:
mapping

{'Average': 0, 'Good': 1, 'Poor': 2}

In [10]:
df.head()

   age  gender  review education experience_level     city purchased
0   58  Female     1.0        PG     Intermediate  Chennai        No
1   25    Male     0.0        PG     Intermediate    Delhi        No
2   19  Female     0.0        UG         Beginner   Mumbai       Yes
3   35  Female     0.0        PG     Intermediate  Chennai        No
4   33  Female     0.0        UG     Intermediate   Mumbai        No

In [11]:
df['experience_level'].unique()

array(['Intermediate', 'Beginner', 'Expert'], dtype=object)

In [12]:
df['experience_level']= oe.fit_transform(df[['experience_level']])

df['experience_level'].head()

0    2.0
1    2.0
2    0.0
3    2.0
4    2.0
Name: experience_level, dtype: float64

In [13]:
dict(zip(oe.categories_[0],range(len(oe.categories_[0]))))

{'Beginner': 0, 'Expert': 1, 'Intermediate': 2}

In [14]:
df.head()

   age  gender  review education  experience_level     city purchased
0   58  Female     1.0        PG               2.0  Chennai        No
1   25    Male     0.0        PG               2.0    Delhi        No
2   19  Female     0.0        UG               0.0   Mumbai       Yes
3   35  Female     0.0        PG               2.0  Chennai        No
4   33  Female     0.0        UG               2.0   Mumbai        No

In [15]:
df.education.unique()

array(['PG', 'UG'], dtype=object)

In [16]:
df.education = oe.fit_transform(df[['education']])

df.education.head()

0    0.0
1    0.0
2    1.0
3    0.0
4    1.0
Name: education, dtype: float64

In [17]:
df.head()

   age  gender  review  education  experience_level     city purchased
0   58  Female     1.0        0.0               2.0  Chennai        No
1   25    Male     0.0        0.0               2.0    Delhi        No
2   19  Female     0.0        1.0               0.0   Mumbai       Yes
3   35  Female     0.0        0.0               2.0  Chennai        No
4   33  Female     0.0        1.0               2.0   Mumbai        No

In [19]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()


df.purchased = le.fit_transform(df['purchased'])

In [20]:
df.purchased.head()

0    0
1    0
2    1
3    0
4    0
Name: purchased, dtype: int64

In [21]:
df.head()

   age  gender  review  education  experience_level     city  purchased
0   58  Female     1.0        0.0               2.0  Chennai          0
1   25    Male     0.0        0.0               2.0    Delhi          0
2   19  Female     0.0        1.0               0.0   Mumbai          1
3   35  Female     0.0        0.0               2.0  Chennai          0
4   33  Female     0.0        1.0               2.0   Mumbai          0

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   age               100 non-null    int64
 1   gender            100 non-null    object
 2   review            100 non-null    float64
 3   education         100 non-null    float64
 4   experience_level  100 non-null    float64
 5   city              100 non-null    object
 6   purchased         100 non-null    int64
dtypes: float64(3), int64(2), object(2)
memory usage: 5.6+ KB